MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA110/mcu.h
extern volatile CNPD2BITS CNPD2bits __attribute__((__sfr__));

#define CNPD3 CNPD3
extern volatile uint16_t CNPD3 __attribute__((__sfr__));
typedef struct tagCNPD3BITS {
  uint16_t CN32PDE:1;
  uint16_t CN33PDE:1;
  uint16_t CN34PDE:1;
  uint16_t CN35PDE:1;
  uint16_t CN36PDE:1;
  uint16_t CN37PDE:1;
  uint16_t CN38PDE:1;
  uint16_t CN39PDE:1;
  uint16_t CN40PDE:1;
  uint16_t CN41PDE:1;
  uint16_t CN42PDE:1;
  uint16_t CN43PDE:1;
  uint16_t CN44PDE:1;
  uint16_t CN45PDE:1;
  uint16_t CN46PDE:1;
  uint16_t CN47PDE:1;
} CNPD3BITS;
extern volatile CNPD3BITS CNPD3bits __attribute__((__sfr__));

#define CNPD4 CNPD4
extern volatile uint16_t CNPD4 __attribute__((__sfr__));
typedef struct tagCNPD4BITS {
  uint16_t CN48PDE:1;
  uint16_t CN49PDE:1;
  uint16_t CN50PDE:1;
  uint16_t CN51PDE:1;
  uint16_t CN52PDE:1;
  uint16_t CN53PDE:1;
  uint16_t CN54PDE:1;
  uint16_t CN55PDE:1;
  uint16_t CN56PDE:1;
  uint16_t CN57PDE:1;
  uint16_t CN58PDE:1;
  uint16_t CN59PDE:1;
  uint16_t CN60PDE:1;
  uint16_t CN61PDE:1;
  uint16_t CN62PDE:1;
  uint16_t CN63PDE:1;
} CNPD4BITS;
extern volatile CNPD4BITS CNPD4bits __attribute__((__sfr__));

#define CNPD5 CNPD5
extern volatile uint16_t CNPD5 __attribute__((__sfr__));
typedef struct tagCNPD5BITS {
  uint16_t CN64PDE:1;
  uint16_t CN65PDE:1;
  uint16_t CN66PDE:1;
  uint16_t CN67PDE:1;
  uint16_t CN68PDE:1;
  uint16_t CN69PDE:1;
  uint16_t CN70PDE:1;
  uint16_t CN71PDE:1;
  uint16_t CN72PDE:1;
  uint16_t CN73PDE:1;
  uint16_t CN74PDE:1;
  uint16_t CN75PDE:1;
  uint16_t CN76PDE:1;
  uint16_t CN77PDE:1;
  uint16_t CN78PDE:1;
  uint16_t CN79PDE:1;
} CNPD5BITS;
extern volatile CNPD5BITS CNPD5bits __attribute__((__sfr__));

#define CNPD6 CNPD6
extern volatile uint16_t CNPD6 __attribute__((__sfr__));
typedef struct tagCNPD6BITS {
  uint16_t CN80PDE:1;
  uint16_t CN81PDE:1;
  uint16_t CN82PDE:1;
  uint16_t CN83PDE:1;
  uint16_t CN84PDE:1;
} CNPD6BITS;
extern volatile CNPD6BITS CNPD6bits __attribute__((__sfr__));

#define CNEN1 CNEN1
extern volatile uint16_t CNEN1 __attribute__((__sfr__));
typedef struct tagCNEN1BITS {
  uint16_t CN0IE:1;
  uint16_t CN1IE:1;
  uint16_t CN2IE:1;
  uint16_t CN3IE:1;
  uint16_t CN4IE:1;
  uint16_t CN5IE:1;
  uint16_t CN6IE:1;
  uint16_t CN7IE:1;
  uint16_t CN8IE:1;
  uint16_t CN9IE:1;
  uint16_t CN10IE:1;
  uint16_t CN11IE:1;
  uint16_t CN12IE:1;
  uint16_t CN13IE:1;
  uint16_t CN14IE:1;
  uint16_t CN15IE:1;
} CNEN1BITS;
extern volatile CNEN1BITS CNEN1bits __attribute__((__sfr__));

#define CNEN2 CNEN2
extern volatile uint16_t CNEN2 __attribute__((__sfr__));
typedef struct tagCNEN2BITS {
  uint16_t CN16IE:1;
  uint16_t CN17IE:1;
  uint16_t CN18IE:1;
  uint16_t CN19IE:1;
  uint16_t CN20IE:1;
  uint16_t CN21IE:1;
  uint16_t CN22IE:1;
  uint16_t CN23IE:1;
  uint16_t CN24IE:1;
  uint16_t CN25IE:1;
  uint16_t CN26IE:1;
  uint16_t CN27IE:1;
  uint16_t CN28IE:1;
  uint16_t CN29IE:1;
  uint16_t CN30IE:1;
  uint16_t CN31IE:1;
} CNEN2BITS;
extern volatile CNEN2BITS CNEN2bits __attribute__((__sfr__));

#define CNEN3 CNEN3
extern volatile uint16_t CNEN3 __attribute__((__sfr__));
typedef struct tagCNEN3BITS {
  uint16_t CN32IE:1;
  uint16_t CN33IE:1;
  uint16_t CN34IE:1;
  uint16_t CN35IE:1;
  uint16_t CN36IE:1;
  uint16_t CN37IE:1;
  uint16_t CN38IE:1;
  uint16_t CN39IE:1;
  uint16_t CN40IE:1;
  uint16_t CN41IE:1;
  uint16_t CN42IE:1;
  uint16_t CN43IE:1;
  uint16_t CN44IE:1;
  uint16_t CN45IE:1;
  uint16_t CN46IE:1;
  uint16_t CN47IE:1;
} CNEN3BITS;
extern volatile CNEN3BITS CNEN3bits __attribute__((__sfr__));

#define CNEN4 CNEN4
extern volatile uint16_t CNEN4 __attribute__((__sfr__));
typedef struct tagCNEN4BITS {
  uint16_t CN48IE:1;
  uint16_t CN49IE:1;
  uint16_t CN50IE:1;
  uint16_t CN51IE:1;
  uint16_t CN52IE:1;
  uint16_t CN53IE:1;
  uint16_t CN54IE:1;
  uint16_t CN55IE:1;
  uint16_t CN56IE:1;
  uint16_t CN57IE:1;
  uint16_t CN58IE:1;
  uint16_t CN59IE:1;
  uint16_t CN60IE:1;
  uint16_t CN61IE:1;
  uint16_t CN62IE:1;
  uint16_t CN63IE:1;
} CNEN4BITS;
extern volatile CNEN4BITS CNEN4bits __attribute__((__sfr__));

#define CNEN5 CNEN5
extern volatile uint16_t CNEN5 __attribute__((__sfr__));
typedef struct tagCNEN5BITS {
  uint16_t CN64IE:1;
  uint16_t CN65IE:1;
  uint16_t CN66IE:1;
  uint16_t CN67IE:1;
  uint16_t CN68IE:1;
  uint16_t CN69IE:1;
  uint16_t CN70IE:1;
  uint16_t CN71IE:1;
  uint16_t CN72IE:1;
  uint16_t CN73IE:1;
  uint16_t CN74IE:1;
  uint16_t CN75IE:1;
  uint16_t CN76IE:1;
  uint16_t CN77IE:1;
  uint16_t CN78IE:1;
  uint16_t CN79IE:1;
} CNEN5BITS;
extern volatile CNEN5BITS CNEN5bits __attribute__((__sfr__));

#define CNEN6 CNEN6
extern volatile uint16_t CNEN6 __attribute__((__sfr__));
typedef struct tagCNEN6BITS {
  uint16_t CN80IE:1;
  uint16_t CN81IE:1;
  uint16_t CN82IE:1;
  uint16_t CN83IE:1;
  uint16_t CN84IE:1;
} CNEN6BITS;
extern volatile CNEN6BITS CNEN6bits __attribute__((__sfr__));

#define CNPU1 CNPU1
extern volatile uint16_t CNPU1 __attribute__((__sfr__));
typedef struct tagCNPU1BITS {
  uint16_t CN0PUE:1;
  uint16_t CN1PUE:1;
  uint16_t CN2PUE:1;
  uint16_t CN3PUE:1;
  uint16_t CN4PUE:1;
  uint16_t CN5PUE:1;
  uint16_t CN6PUE:1;
  uint16_t CN7PUE:1;
  uint16_t CN8PUE:1;
  uint16_t CN9PUE:1;
  uint16_t CN10PUE:1;
  uint16_t CN11PUE:1;
  uint16_t CN12PUE:1;
  uint16_t CN13PUE:1;
  uint16_t CN14PUE:1;
  uint16_t CN15PUE:1;
} CNPU1BITS;
extern volatile CNPU1BITS CNPU1bits __attribute__((__sfr__));

#define CNPU2 CNPU2
extern volatile uint16_t CNPU2 __attribute__((__sfr__));
typedef struct tagCNPU2BITS {
  uint16_t CN16PUE:1;
  uint16_t CN17PUE:1;
  uint16_t CN18PUE:1;
  uint16_t CN19PUE:1;
  uint16_t CN20PUE:1;
  uint16_t CN21PUE:1;
  uint16_t CN22PUE:1;
  uint16_t CN23PUE:1;
  uint16_t CN24PUE:1;
  uint16_t CN25PUE:1;
  uint16_t CN26PUE:1;
  uint16_t CN27PUE:1;
  uint16_t CN28PUE:1;
  uint16_t CN29PUE:1;
  uint16_t CN30PUE:1;
  uint16_t CN31PUE:1;
} CNPU2BITS;
extern volatile CNPU2BITS CNPU2bits __attribute__((__sfr__));

#define CNPU3 CNPU3
extern volatile uint16_t CNPU3 __attribute__((__sfr__));
typedef struct tagCNPU3BITS {
  uint16_t CN32PUE:1;
  uint16_t CN33PUE:1;
  uint16_t CN34PUE:1;
  uint16_t CN35PUE:1;
  uint16_t CN36PUE:1;
  uint16_t CN37PUE:1;
  uint16_t CN38PUE:1;
  uint16_t CN39PUE:1;
  uint16_t CN40PUE:1;
  uint16_t CN41PUE:1;
  uint16_t CN42PUE:1;
  uint16_t CN43PUE:1;
  uint16_t CN44PUE:1;
  uint16_t CN45PUE:1;
  uint16_t CN46PUE:1;
  uint16_t CN47PUE:1;
} CNPU3BITS;
extern volatile CNPU3BITS CNPU3bits __attribute__((__sfr__));

