MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA110/mcu.h
#define _CNPD2_CN16PDE_POSITION                  0x00000000
#define _CNPD2_CN16PDE_MASK                      0x00000001
#define _CNPD2_CN16PDE_LENGTH                    0x00000001

#define _CNPD2_CN17PDE_POSITION                  0x00000001
#define _CNPD2_CN17PDE_MASK                      0x00000002
#define _CNPD2_CN17PDE_LENGTH                    0x00000001

#define _CNPD2_CN18PDE_POSITION                  0x00000002
#define _CNPD2_CN18PDE_MASK                      0x00000004
#define _CNPD2_CN18PDE_LENGTH                    0x00000001

#define _CNPD2_CN19PDE_POSITION                  0x00000003
#define _CNPD2_CN19PDE_MASK                      0x00000008
#define _CNPD2_CN19PDE_LENGTH                    0x00000001

#define _CNPD2_CN20PDE_POSITION                  0x00000004
#define _CNPD2_CN20PDE_MASK                      0x00000010
#define _CNPD2_CN20PDE_LENGTH                    0x00000001

#define _CNPD2_CN21PDE_POSITION                  0x00000005
#define _CNPD2_CN21PDE_MASK                      0x00000020
#define _CNPD2_CN21PDE_LENGTH                    0x00000001

#define _CNPD2_CN22PDE_POSITION                  0x00000006
#define _CNPD2_CN22PDE_MASK                      0x00000040
#define _CNPD2_CN22PDE_LENGTH                    0x00000001

#define _CNPD2_CN23PDE_POSITION                  0x00000007
#define _CNPD2_CN23PDE_MASK                      0x00000080
#define _CNPD2_CN23PDE_LENGTH                    0x00000001

#define _CNPD2_CN24PDE_POSITION                  0x00000008
#define _CNPD2_CN24PDE_MASK                      0x00000100
#define _CNPD2_CN24PDE_LENGTH                    0x00000001

#define _CNPD2_CN25PDE_POSITION                  0x00000009
#define _CNPD2_CN25PDE_MASK                      0x00000200
#define _CNPD2_CN25PDE_LENGTH                    0x00000001

#define _CNPD2_CN26PDE_POSITION                  0x0000000A
#define _CNPD2_CN26PDE_MASK                      0x00000400
#define _CNPD2_CN26PDE_LENGTH                    0x00000001

#define _CNPD2_CN27PDE_POSITION                  0x0000000B
#define _CNPD2_CN27PDE_MASK                      0x00000800
#define _CNPD2_CN27PDE_LENGTH                    0x00000001

#define _CNPD2_CN28PDE_POSITION                  0x0000000C
#define _CNPD2_CN28PDE_MASK                      0x00001000
#define _CNPD2_CN28PDE_LENGTH                    0x00000001

#define _CNPD2_CN29PDE_POSITION                  0x0000000D
#define _CNPD2_CN29PDE_MASK                      0x00002000
#define _CNPD2_CN29PDE_LENGTH                    0x00000001

#define _CNPD2_CN30PDE_POSITION                  0x0000000E
#define _CNPD2_CN30PDE_MASK                      0x00004000
#define _CNPD2_CN30PDE_LENGTH                    0x00000001

#define _CNPD2_CN31PDE_POSITION                  0x0000000F
#define _CNPD2_CN31PDE_MASK                      0x00008000
#define _CNPD2_CN31PDE_LENGTH                    0x00000001

#define _CNPD3_CN32PDE_POSITION                  0x00000000
#define _CNPD3_CN32PDE_MASK                      0x00000001
#define _CNPD3_CN32PDE_LENGTH                    0x00000001

#define _CNPD3_CN33PDE_POSITION                  0x00000001
#define _CNPD3_CN33PDE_MASK                      0x00000002
#define _CNPD3_CN33PDE_LENGTH                    0x00000001

#define _CNPD3_CN34PDE_POSITION                  0x00000002
#define _CNPD3_CN34PDE_MASK                      0x00000004
#define _CNPD3_CN34PDE_LENGTH                    0x00000001

#define _CNPD3_CN35PDE_POSITION                  0x00000003
#define _CNPD3_CN35PDE_MASK                      0x00000008
#define _CNPD3_CN35PDE_LENGTH                    0x00000001

#define _CNPD3_CN36PDE_POSITION                  0x00000004
#define _CNPD3_CN36PDE_MASK                      0x00000010
#define _CNPD3_CN36PDE_LENGTH                    0x00000001

#define _CNPD3_CN37PDE_POSITION                  0x00000005
#define _CNPD3_CN37PDE_MASK                      0x00000020
#define _CNPD3_CN37PDE_LENGTH                    0x00000001

#define _CNPD3_CN38PDE_POSITION                  0x00000006
#define _CNPD3_CN38PDE_MASK                      0x00000040
#define _CNPD3_CN38PDE_LENGTH                    0x00000001

#define _CNPD3_CN39PDE_POSITION                  0x00000007
#define _CNPD3_CN39PDE_MASK                      0x00000080
#define _CNPD3_CN39PDE_LENGTH                    0x00000001

#define _CNPD3_CN40PDE_POSITION                  0x00000008
#define _CNPD3_CN40PDE_MASK                      0x00000100
#define _CNPD3_CN40PDE_LENGTH                    0x00000001

#define _CNPD3_CN41PDE_POSITION                  0x00000009
#define _CNPD3_CN41PDE_MASK                      0x00000200
#define _CNPD3_CN41PDE_LENGTH                    0x00000001

#define _CNPD3_CN42PDE_POSITION                  0x0000000A
#define _CNPD3_CN42PDE_MASK                      0x00000400
#define _CNPD3_CN42PDE_LENGTH                    0x00000001

#define _CNPD3_CN43PDE_POSITION                  0x0000000B
#define _CNPD3_CN43PDE_MASK                      0x00000800
#define _CNPD3_CN43PDE_LENGTH                    0x00000001

#define _CNPD3_CN44PDE_POSITION                  0x0000000C
#define _CNPD3_CN44PDE_MASK                      0x00001000
#define _CNPD3_CN44PDE_LENGTH                    0x00000001

#define _CNPD3_CN45PDE_POSITION                  0x0000000D
#define _CNPD3_CN45PDE_MASK                      0x00002000
#define _CNPD3_CN45PDE_LENGTH                    0x00000001

#define _CNPD3_CN46PDE_POSITION                  0x0000000E
#define _CNPD3_CN46PDE_MASK                      0x00004000
#define _CNPD3_CN46PDE_LENGTH                    0x00000001

#define _CNPD3_CN47PDE_POSITION                  0x0000000F
#define _CNPD3_CN47PDE_MASK                      0x00008000
#define _CNPD3_CN47PDE_LENGTH                    0x00000001

#define _CNPD4_CN48PDE_POSITION                  0x00000000
#define _CNPD4_CN48PDE_MASK                      0x00000001
#define _CNPD4_CN48PDE_LENGTH                    0x00000001

#define _CNPD4_CN49PDE_POSITION                  0x00000001
#define _CNPD4_CN49PDE_MASK                      0x00000002
#define _CNPD4_CN49PDE_LENGTH                    0x00000001

#define _CNPD4_CN50PDE_POSITION                  0x00000002
#define _CNPD4_CN50PDE_MASK                      0x00000004
#define _CNPD4_CN50PDE_LENGTH                    0x00000001

#define _CNPD4_CN51PDE_POSITION                  0x00000003
#define _CNPD4_CN51PDE_MASK                      0x00000008
#define _CNPD4_CN51PDE_LENGTH                    0x00000001

#define _CNPD4_CN52PDE_POSITION                  0x00000004
#define _CNPD4_CN52PDE_MASK                      0x00000010
#define _CNPD4_CN52PDE_LENGTH                    0x00000001

