MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA110/mcu.h
#define _CNEN4_CN48IE_POSITION                   0x00000000
#define _CNEN4_CN48IE_MASK                       0x00000001
#define _CNEN4_CN48IE_LENGTH                     0x00000001

#define _CNEN4_CN49IE_POSITION                   0x00000001
#define _CNEN4_CN49IE_MASK                       0x00000002
#define _CNEN4_CN49IE_LENGTH                     0x00000001

#define _CNEN4_CN50IE_POSITION                   0x00000002
#define _CNEN4_CN50IE_MASK                       0x00000004
#define _CNEN4_CN50IE_LENGTH                     0x00000001

#define _CNEN4_CN51IE_POSITION                   0x00000003
#define _CNEN4_CN51IE_MASK                       0x00000008
#define _CNEN4_CN51IE_LENGTH                     0x00000001

#define _CNEN4_CN52IE_POSITION                   0x00000004
#define _CNEN4_CN52IE_MASK                       0x00000010
#define _CNEN4_CN52IE_LENGTH                     0x00000001

#define _CNEN4_CN53IE_POSITION                   0x00000005
#define _CNEN4_CN53IE_MASK                       0x00000020
#define _CNEN4_CN53IE_LENGTH                     0x00000001

#define _CNEN4_CN54IE_POSITION                   0x00000006
#define _CNEN4_CN54IE_MASK                       0x00000040
#define _CNEN4_CN54IE_LENGTH                     0x00000001

#define _CNEN4_CN55IE_POSITION                   0x00000007
#define _CNEN4_CN55IE_MASK                       0x00000080
#define _CNEN4_CN55IE_LENGTH                     0x00000001

#define _CNEN4_CN56IE_POSITION                   0x00000008
#define _CNEN4_CN56IE_MASK                       0x00000100
#define _CNEN4_CN56IE_LENGTH                     0x00000001

#define _CNEN4_CN57IE_POSITION                   0x00000009
#define _CNEN4_CN57IE_MASK                       0x00000200
#define _CNEN4_CN57IE_LENGTH                     0x00000001

#define _CNEN4_CN58IE_POSITION                   0x0000000A
#define _CNEN4_CN58IE_MASK                       0x00000400
#define _CNEN4_CN58IE_LENGTH                     0x00000001

#define _CNEN4_CN59IE_POSITION                   0x0000000B
#define _CNEN4_CN59IE_MASK                       0x00000800
#define _CNEN4_CN59IE_LENGTH                     0x00000001

#define _CNEN4_CN60IE_POSITION                   0x0000000C
#define _CNEN4_CN60IE_MASK                       0x00001000
#define _CNEN4_CN60IE_LENGTH                     0x00000001

#define _CNEN4_CN61IE_POSITION                   0x0000000D
#define _CNEN4_CN61IE_MASK                       0x00002000
#define _CNEN4_CN61IE_LENGTH                     0x00000001

#define _CNEN4_CN62IE_POSITION                   0x0000000E
#define _CNEN4_CN62IE_MASK                       0x00004000
#define _CNEN4_CN62IE_LENGTH                     0x00000001

#define _CNEN4_CN63IE_POSITION                   0x0000000F
#define _CNEN4_CN63IE_MASK                       0x00008000
#define _CNEN4_CN63IE_LENGTH                     0x00000001

#define _CNEN5_CN64IE_POSITION                   0x00000000
#define _CNEN5_CN64IE_MASK                       0x00000001
#define _CNEN5_CN64IE_LENGTH                     0x00000001

#define _CNEN5_CN65IE_POSITION                   0x00000001
#define _CNEN5_CN65IE_MASK                       0x00000002
#define _CNEN5_CN65IE_LENGTH                     0x00000001

#define _CNEN5_CN66IE_POSITION                   0x00000002
#define _CNEN5_CN66IE_MASK                       0x00000004
#define _CNEN5_CN66IE_LENGTH                     0x00000001

#define _CNEN5_CN67IE_POSITION                   0x00000003
#define _CNEN5_CN67IE_MASK                       0x00000008
#define _CNEN5_CN67IE_LENGTH                     0x00000001

#define _CNEN5_CN68IE_POSITION                   0x00000004
#define _CNEN5_CN68IE_MASK                       0x00000010
#define _CNEN5_CN68IE_LENGTH                     0x00000001

#define _CNEN5_CN69IE_POSITION                   0x00000005
#define _CNEN5_CN69IE_MASK                       0x00000020
#define _CNEN5_CN69IE_LENGTH                     0x00000001

#define _CNEN5_CN70IE_POSITION                   0x00000006
#define _CNEN5_CN70IE_MASK                       0x00000040
#define _CNEN5_CN70IE_LENGTH                     0x00000001

#define _CNEN5_CN71IE_POSITION                   0x00000007
#define _CNEN5_CN71IE_MASK                       0x00000080
#define _CNEN5_CN71IE_LENGTH                     0x00000001

#define _CNEN5_CN72IE_POSITION                   0x00000008
#define _CNEN5_CN72IE_MASK                       0x00000100
#define _CNEN5_CN72IE_LENGTH                     0x00000001

#define _CNEN5_CN73IE_POSITION                   0x00000009
#define _CNEN5_CN73IE_MASK                       0x00000200
#define _CNEN5_CN73IE_LENGTH                     0x00000001

#define _CNEN5_CN74IE_POSITION                   0x0000000A
#define _CNEN5_CN74IE_MASK                       0x00000400
#define _CNEN5_CN74IE_LENGTH                     0x00000001

#define _CNEN5_CN75IE_POSITION                   0x0000000B
#define _CNEN5_CN75IE_MASK                       0x00000800
#define _CNEN5_CN75IE_LENGTH                     0x00000001

#define _CNEN5_CN76IE_POSITION                   0x0000000C
#define _CNEN5_CN76IE_MASK                       0x00001000
#define _CNEN5_CN76IE_LENGTH                     0x00000001

#define _CNEN5_CN77IE_POSITION                   0x0000000D
#define _CNEN5_CN77IE_MASK                       0x00002000
#define _CNEN5_CN77IE_LENGTH                     0x00000001

#define _CNEN5_CN78IE_POSITION                   0x0000000E
#define _CNEN5_CN78IE_MASK                       0x00004000
#define _CNEN5_CN78IE_LENGTH                     0x00000001

#define _CNEN5_CN79IE_POSITION                   0x0000000F
#define _CNEN5_CN79IE_MASK                       0x00008000
#define _CNEN5_CN79IE_LENGTH                     0x00000001

#define _CNEN6_CN80IE_POSITION                   0x00000000
#define _CNEN6_CN80IE_MASK                       0x00000001
#define _CNEN6_CN80IE_LENGTH                     0x00000001

#define _CNEN6_CN81IE_POSITION                   0x00000001
#define _CNEN6_CN81IE_MASK                       0x00000002
#define _CNEN6_CN81IE_LENGTH                     0x00000001

#define _CNEN6_CN82IE_POSITION                   0x00000002
#define _CNEN6_CN82IE_MASK                       0x00000004
#define _CNEN6_CN82IE_LENGTH                     0x00000001

#define _CNEN6_CN83IE_POSITION                   0x00000003
#define _CNEN6_CN83IE_MASK                       0x00000008
#define _CNEN6_CN83IE_LENGTH                     0x00000001

#define _CNEN6_CN84IE_POSITION                   0x00000004
#define _CNEN6_CN84IE_MASK                       0x00000010
#define _CNEN6_CN84IE_LENGTH                     0x00000001

